In [1]:
import pandas as pd

#### Series

In [ ]:
# We need to take either list / tuple and convert them into series
# 1D data structure
# SERIES CAN HOLD SINGLE DATA TYPE
# 3 parameters --> Values , index , data type (dtype)

In [3]:
sr1 = pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
# 0,1,2,3,4 --> index ( starting from 0 ) # you can see index
# 10,20,30,40,50 --> values ( list / tuple )
# dtype : data type --> integer (64/32 )

In [4]:
sr1[3]

40

In [5]:
sr1 = pd.Series([10,20,30,40,50], index = ['a','b','c','d','e'], dtype = float)
sr1

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
dtype: float64

In [6]:
sr1[3]

C:\Users\admin\AppData\Local\Temp\ipykernel_17592\1503293489.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sr1[3]

40.0

In [7]:
sr1['c']

30.0

#### DataFrame

In [ ]:
# 2D data structure similar to table format
# like series each column can handle single data type 
# array , dictionary

In [8]:
# key :value ( for creating a data frame values can be list / tuple / series )
dict1 = {'col1': [10,20,30,40,50],
         'col2': pd.Series(('a','b','c','d','e'))}
dict1

{'col1': [10, 20, 30, 40, 50],
 'col2': 0    a
 1    b
 2    c
 3    d
 4    e
 dtype: object}

In [9]:
df1 =  pd.DataFrame(dict1)
df1

   col1 col2
0    10    a
1    20    b
2    30    c
3    40    d
4    50    e

In [10]:
df1.dtypes
# object : strings

col1     int64
col2    object
dtype: object

#### Merge

In [11]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [97,92,95,96,91]})
df2 = pd.DataFrame({'id': [3,4,5,6,7],'ml_marks': [87,94,91,92,89]})
df2

   id  ml_marks
0   3        87
1   4        94
2   5        91
3   6        92
4   7        89

In [ ]:
# select * from df1 
# join df2 on df1.id = df2.id

In [ ]:
# SQL JOIN = pandas merge

In [12]:
df1.merge(df2,on = 'id', how = 'inner')

   id  stat_marks  ml_marks
0   3          95        87
1   4          96        94
2   5          91        91

In [13]:
df1.merge(df2,on = 'id', how = 'left')

   id  stat_marks  ml_marks
0   1          97       NaN
1   2          92       NaN
2   3          95      87.0
3   4          96      94.0
4   5          91      91.0

In [14]:
df1.merge(df2,on = 'id', how = 'right')

   id  stat_marks  ml_marks
0   3        95.0        87
1   4        96.0        94
2   5        91.0        91
3   6         NaN        92
4   7         NaN        89

In [15]:
df1.merge(df2,on = 'id', how = 'outer')

   id  stat_marks  ml_marks
0   1        97.0       NaN
1   2        92.0       NaN
2   3        95.0      87.0
3   4        96.0      94.0
4   5        91.0      91.0
5   6         NaN      92.0
6   7         NaN      89.0

In [ ]:
# if column names are different 
# select * from df1 join df2 on df1.id = df2.sno
# df1.merge(df2, left_on = 'id', right_on = 'sno', how = 'inner')

In [ ]:
# if column names are different and multiple columns to join 
# select * from df1 join df2 on df1.id = df2.sno and df1.school = df2.school
# df1.merge(df2, left_on = ['id','school'], right_on = ['sno','school'], how = 'inner')

#### Concat

In [ ]:
# if you want to join two tables at row level

In [19]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [97,92,95,96,91]})
df2 = pd.DataFrame({'id': [6,7,8,9,10],'stat_marks': [87,94,91,92,89]})

In [20]:
pd.concat([df1,df2])

   id  stat_marks
0   1          97
1   2          92
2   3          95
3   4          96
4   5          91
0   6          87
1   7          94
2   8          91
3   9          92
4  10          89

In [23]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [97,92,95,96,91]})
df2 = pd.DataFrame({'id': [1,1,1,1,1],'ml_marks': [87,94,91,92,89]})
pd.concat([df1,df2])

   id  stat_marks  ml_marks
0   1        97.0       NaN
1   2        92.0       NaN
2   3        95.0       NaN
3   4        96.0       NaN
4   5        91.0       NaN
0   1         NaN      87.0
1   1         NaN      94.0
2   1         NaN      91.0
3   1         NaN      92.0
4   1         NaN      89.0

#### JOIN

In [26]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [97,92,95,96,91]})
df2 = pd.DataFrame({'id': [6,7,8,9,10],'ml_marks': [87,94,91,92,89]})

In [27]:
df1.join(df2,lsuffix='_df1',rsuffix = '_df2')
# when having common column names they need to be differentiated using suffix parameters
# it will combine two data frames using index values

   id_df1  stat_marks  id_df2  ml_marks
0       1          97       6        87
1       2          92       7        94
2       3          95       8        91
3       4          96       9        92
4       5          91      10        89